# 合并数据集

## 数据库风格的DataFrame合并

In [1]:
import pandas as pd
from pandas import DataFrame

In [2]:
df1 = DataFrame({
    'key':['b','b','a','c','a','a','b'],
    'data1':range(7)
})

In [3]:
df2 = DataFrame ({
    'key':['a','b','d'],
    'data2':range(3)
})

In [4]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [5]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [6]:
#默认情况下merge取的是交集
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

## 数据转换

### 移除重复数据

In [7]:
data = DataFrame ({
    'k1':['one'] *3 +['two'] *4,
    'k2':[1,1,2,3,3,4,4]
})

In [8]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [9]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [11]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4